
SELECT * FROM Products
INSERT INTO Products(createDate, categoryID, name) VALUES
(GETDATE(),4,N'Картопля'),
(GETDATE(),11,N'Квашена капуста'),
(GETDATE(),10,N'Томатна паста'),
(GETDATE(),11,N'Мед'),
(GETDATE(),11,N'Олія'),
(GETDATE(),13,N'Кока-Кола'),
(GETDATE(),13,N'Фанта'),
(GETDATE(),13,N'Енергетик'),
(GETDATE(),13,N'Сік'),
(GETDATE(),3,N'Яблука'),
(GETDATE(),3,N'Банани'),
(GETDATE(),3,N'Апельсини'),
(GETDATE(),3,N'Груші'),
(GETDATE(),3,N'Сливи'),
(GETDATE(),3,N'Полуниці'),
(GETDATE(),3,N'Виноград'),
(GETDATE(),3,N'Ківі'),
(GETDATE(),3,N'Манго'),
(GETDATE(),3,N'Авокадо'),
(GETDATE(),4,N'Брокколі'),
(GETDATE(),4,N'Морква'),
(GETDATE(),4,N'Помідори'),
(GETDATE(),4,N'Огірки'),
(GETDATE(),4,N'Шпинат'),
(GETDATE(),4,N'Цибуля'),
(GETDATE(),4,N'Буряк'),
(GETDATE(),4,N'Перець'),
(GETDATE(),4,N'Салат'),
(GETDATE(),4,N'Часник'),
(GETDATE(),5,N'Курятина'),
(GETDATE(),5,N'Свинина'),
(GETDATE(),5,N'Яловичина'),
(GETDATE(),5,N'Ковбаса'),
(GETDATE(),5,N'Курячі крильця'),
(GETDATE(),5,N'Індичка'),
(GETDATE(),5,N'Фарш м''ясний'),
(GETDATE(),5,N'Салямі'),
(GETDATE(),5,N'Ковбаса салямі'),
(GETDATE(),5,N'Мисливські ковбаски'),
(GETDATE(),2,N'Молоко'),
(GETDATE(),2,N'Сир чеддер'),
(GETDATE(),2,N'Йогурт'),
(GETDATE(),2,N'Масло вершкове'),
(GETDATE(),2,N'Сметана'),
(GETDATE(),2,N'Кисіль'),
(GETDATE(),2,N'Сир фета'),
(GETDATE(),2,N'Сир пармезан'),
(GETDATE(),2,N'Масло оливкове'),
(GETDATE(),2,N'Кефір'),
(GETDATE(),11,N'Курячі яйця'),
(GETDATE(),11,N'Качині яйця'),
(GETDATE(),11,N'Перепелині яйця'),
(GETDATE(),11,N'Яйця страуса'),
(GETDATE(),11,N'Утині яйця'),
(GETDATE(),11,N'Яйця ящериці'),
(GETDATE(),11,N'Яйця гусей'),
(GETDATE(),11,N'Яйця курей-брама'),
(GETDATE(),11,N'Яйця курей-кокошек'),
(GETDATE(),11,N'Яйця гусаків'),
(GETDATE(),1,N'Рис'),
(GETDATE(),1,N'Хліб'),
(GETDATE(),1,N'Овес'),
(GETDATE(),1,N'Гречка'),
(GETDATE(),1,N'Кукурудза'),
(GETDATE(),1,N'Пшоно'),
(GETDATE(),1,N'Паста'),
(GETDATE(),1,N'Ячмінь'),
(GETDATE(),1,N'Квасоля'),
(GETDATE(),1,N'Цільнозерновий хліб'),
(GETDATE(),1,N'Перець'),
(GETDATE(),12,N'Сіль'),
(GETDATE(),12,N'Цукор'),
(GETDATE(),12,N'Італійські трави'),
(GETDATE(),12,N'Лавровий лист'),
(GETDATE(),12,N'Гроздика'),
(GETDATE(),12,N'Мелений часник'),
(GETDATE(),12,N'Паприка'),
(GETDATE(),12,N'Куркума'),
(GETDATE(),7,N'Креветки '),
(GETDATE(),7,N'Мідії'),
(GETDATE(),7,N'Сьомга'),
(GETDATE(),7,N'Кальмари'),
(GETDATE(),7,N'Восьминоги'),
(GETDATE(),7,N'Морські коники'),
(GETDATE(),7,N'Ікра консервована'),
(GETDATE(),6,N'Хек'),
(GETDATE(),6,N'Макрель'),
(GETDATE(),6,N'Оселедець'),
(GETDATE(),6,N'Сардина'),
(GETDATE(),6,N'Шпроти'),
(GETDATE(),6,N'Тріска'),
(GETDATE(),6,N'Карась'),
(GETDATE(),6,N'Судак'),
(GETDATE(),8,N'Шоколад'),
(GETDATE(),8,N'Мафіни'),
(GETDATE(),8,N'Пончики'),
(GETDATE(),8,N'Зефір'),
(GETDATE(),9,N'Горілка'),
(GETDATE(),9,N'Віскі'),
(GETDATE(),9,N'Коньяк'),
(GETDATE(),9,N'Ром'),
(GETDATE(),9,N'Текіла'),
(GETDATE(),9,N'Абсент'),
(GETDATE(),9,N'Лікер фруктовий'),
(GETDATE(),9,N'Пиво'),
(GETDATE(),9,N'Вино'),
(GETDATE(),9,N'Джин'),
(GETDATE(),10,N'Майонез'),
(GETDATE(),10,N'Кентчуп'),
(GETDATE(),10,N'Гірчиця'),
(GETDATE(),10,N'Соєвий соус'),
(GETDATE(),10,N'Барбек''ю'),
(GETDATE(),10,N'Каррі'),
(GETDATE(),10,N'Тартар'),
(GETDATE(),10,N'Теріякі')



INSERT INTO Categories VALUES 
(
N'Балаклійні', GETDATE(), N'Зберігайте балаклійні продукти у герметичних контейнерах в прохолодному та сухому місці, 
уникаючи прямого сонячного світла, з позначенням дати придбання для контролю терміну придатності.'
),
(
N'Молочні', GETDATE(), N'Зберігайте молочні продукти у холодильнику при температурі до 4 градусів Цельсія, уникаючи їх довготривалого зберігання за межами холодильної камери, та слідкуючи за термінами придатності для забезпечення свіжості та безпеки.'
),
(
N'Фрукти', GETDATE(), N'Зберігайте фрукти в холодильнику або прохолодному та провітрюваному місці, уникаючи їхнього зберігання поруч із овочами, щоб уникнути взаємного впливу на смак та аромат; також слід враховувати різні терміни зберігання для різних видів фруктів.'
),
(
N'Овочі', GETDATE(), N'Зберігайте овочі в холодильнику або прохолодному, вологому місці, уникаючи зберігання їх поруч із фруктами, оскільки деякі фрукти виділяють етилен, що може призвести до швидшого старіння овочів; дотримуйтеся індивідуальних вимог щодо температури та вологості для кожного виду овочів, а також враховуйте терміни зберігання для забезпечення максимальної свіжості та вітамінного складу.'
),
(
N'М''ясні',GETDATE(), N'Зберігайте м''ясні продукти у холодильнику при температурі до 4 градусів Цельсія, уникайте контакту сирої та готової їжі для запобігання перекачуванню бактерій, використовуйте контейнери зі справним замком для уникнення забруднення та дотримуйтеся рекомендацій щодо термінів зберігання для забезпечення безпеки та якості продуктів.'
),
(
N'Рибні', GETDATE(), N'Зберігайте рибу в холодильнику при температурі від 0 до 4 градусів Цельсія, упаковуючи її в герметичний контейнер чи плівку, щоб уникнути запахів та зберегти свіжість.'
),
(
N'Морепродукти', GETDATE(), N'Зберігайте морепродукти в холодильнику при температурі від 0 до 4 градусів Цельсія, використовуючи герметичні контейнери чи плівку, уникаючи контакту з сирою рибою, і споживайте якнайшвидше для збереження свіжості та запобігання псуванню; також слід враховувати індивідуальні властивості кожного виду морепродуктів під час зберігання.'
),
(
N'Солодощі', GETDATE(), N'Зберігайте солодощі в сухому, прохолодному місці, уникайте тепла та сонця, і у вас завжди буде задоволення в кожному шматочку шоколаду.'
),
(
N'Алкоголь', GETDATE(), N'Алкоголь теж має свої капризи: тримайте його в прохолодному, темному місці, уникайте температурних стрибків, і не дозволяйте сонцю руйнувати партію, а краще — створіть власну міні-винницю в дому!'
),
(
N'Соуси', GETDATE(), N'Щоб зберегти соуси в ідеальному стані, тримайте їх у холодильнику, уникаючи світла та переконливо закриваючи кришку.'
),
(
N'Інше', GETDATE(), N'Зберігайте яйця в холодильнику при температурі близько 4 градусів Цельсія із головою вниз, щоб подовжити їхній термін придатності та запобігти можливому забрудненню.'
),
(
N'Приправи', GETDATE(), N'Зберігайте приправи в герметичних контейнерах у прохолодному та сухому місці, далеко від прямих сонячних променів, щоб забезпечити довготривалу свіжість та смакові якості.'
),

INSERT INTO Categories VALUES(
N'Напої', GETDATE(), N'
Зберігайте напої в прохолодному місці, уникайте прямого сонячного світла та високих температур для збереження їхнього смаку та якості.'
)


INSERT INTO ReceiptsProducts VALUES 
(
	1, 12, N'Половина'
),
(
	1, 16, N'1'
),
(
	1, 17, N'2'
),
(
	1, 18, N'Половина'
),
(
	1, 61, N'По смаку'
),
(
	1, 62, N'По смаку'
),
(
	1, 108, N'2 л'
),
(
	1, 116, N'200 грам'
),
(
	1, 117, N'2 столові ложки'
),
(
	1, 118, N'1-2 столові ложки'
),
(
	1, 119, N'3-4'
)


INSERT INTO Receipts VALUES(
	N'Борщ', N'1. Спершу приготуйте відвар з двох буряків. Почистьте та розріжте навпіл коренеплід. Залийте його водою та відваріть 40 хв до готовності. Після продовжуйте варити далі, додавши ½ цибулини.
	2.Наріжте 3-4 картоплини кубиками та пів моркви соломкою. Варіть їх разом з буряком.
	3.Зробіть засмажку. Наріжте кубиками пів болгарського перцю та другу половину цибулі. Обсмажте 3-5 хвилин з невеликою кількістю рослинної олії. Додайте 2 ст. л. томатної пасти й протушкуйте ще 2-3 хвилини.
	4.Дайте відвареному буряку охолонути та наріжте довільно. А потім — разом з засмажкою відправте назад у відвар.
	5.Коли всі овочі приготуються, додайте квашену капусту з 200 г розсолу. Проваріть 2-3 хвилини й додайте сіль, перець та 1-2 ст.л. меду.
	6.Залиште настоюватися готовий борщ 15-20 хвилин або ж помістіть на цей час у духовку на 180 градусів.
	7.Подавати краще на наступний день, щоб настоявся. Так кажуть у народі!',
	NULL, 1
)




